import React from 'react';
import {ScrollPanel} from "primereact/scrollpanel";

const ConsentToProcess = () => {
    return (
        <ScrollPanel style={{ width: '100%', height: '70%', marginTop: '10px' }}>
            <p>
                Настоящим я, во исполнение требований Федерального закона от 27.07.2006 г. №
                152-ФЗ «О персональных данных», свободно, своей волей и в своем интересе
                предоставляю и даю свое согласие Индивидуальному предпринимателю Рязановой
                Анастасии Валерьевне (ИНН 246310211860), адрес: Красноярский кр., г.
                Красноярск, ул. Академика Киренского&nbsp;3А,&nbsp;кв.&nbsp;68 (далее –
                Исполнитель) на обработку своих персональных данных при использовании
                интернет-сайта <a target="_blank" rel="noreferrer" href="https://leafvisa.ru/">https://leafvisa.ru/</a> и
                (или) телеграм-бота&nbsp;
                <a target="_blank" rel="noreferrer" href="https://t.me/FranceVFSSeller_Bot">
                    https://t.me/FranceVFSSeller_Bot
                </a>{" "}
                на следующих условиях:
            </p>
            <ol>
                <li>
                    Настоящее Согласие дается на обработку моих персональных данных, как без
                    использования средств автоматизации, так и с их использованием. Согласие
                    дается на обработку моих персональных данных, в частности: фамилия, имя,
                    отчество; дата рождения; пол; гражданство; адрес; номер документа,
                    удостоверяющего личность (паспорт), и сведения о дате выдачи указанного
                    документа и выдавшем его органе; номер телефона; электронная почта;
                    пользовательские данные (сведения о местоположении, тип и версия ОС, тип и
                    версия браузера, тип устройства и разрешение его экрана; источник, откуда
                    пришел на сайт пользователь; с какого сайта или по какой рекламе; язык ОС
                    и браузера; какие страницы открывает и на какие кнопки нажимает
                    пользователь; ip-адрес); данные обо мне, которые станут известны в ходе
                    заключения и исполнения договора с Исполнителем (в случае заключения мной
                    договора - акцепта оферты Исполнителя). Настоящее Согласие дается также на
                    обработку следующих персональных данных представителя (при подписании
                    Согласия представителем субъекта персональных данных): фамилию, имя,
                    отчество, дата рождения, пол, гражданство и адрес представителя субъекта
                    персональных данных, номер документа, удостоверяющего личность (паспорт),
                    сведения о дате выдачи указанного документа и выдавшем его органе,
                    реквизиты доверенности или иного документа, подтверждающего полномочия
                    представителя.
                </li>
                <li>Персональные данные не являются общедоступными.</li>
                <li>
                    Цель обработки персональных данных: обработка входящих запросов
                    пользователя (физического лица) с целью оказания услуги, относящейся к
                    сфере предпринимательской деятельности Исполнителя, и (или) заключения
                    договора между Исполнителем и пользователем (акцепта оферты) посредством
                    использования ресурсов интернет-сайта{" "}
                    <a target="_blank" rel="noreferrer" href="https://leafvisa.ru/">https://leafvisa.ru/</a> и (или)
                    телеграм-бота&nbsp;
                    <a target="_blank" rel="noreferrer" href="https://t.me/FranceVFSSeller_Bot">
                        https://t.me/FranceVFSSeller_Bot
                    </a>
                    .
                </li>
                <li>
                    Основанием для обработки персональных данных является статья 24
                    Конституции Российской Федерации; статья 6 Федерального закона № 152-ФЗ «О
                    персональных данных» и настоящее Согласие.
                </li>
                <li>
                    В ходе обработки персональных данных пользователя будут совершаться любые
                    действия (операции) с персональными данными, включая: сбор, запись,
                    систематизация, накопление, хранение, уточнение (обновление, изменение),
                    извлечение, использование, передача (распространение, предоставление,
                    доступ), блокирование, удаление, уничтожение.
                </li>
                <li>
                    Настоящим я уведомлен и согласен, что предполагаемыми пользователями
                    персональных данных являются работники Исполнителя и (или) лица,
                    привлеченные Исполнителем на условиях гражданско-правового договора.
                </li>
            </ol>
            <p>
                Настоящим я соглашаюсь, что мои персональные данные предоставляются также
                могут быть представлены по запросу правоохранительным и иным государственным
                органам в случаях, установленных законодательством.
            </p>
            <ol start={7}>
                <li>Я ознакомлен (-а), что:</li>
            </ol>
            <p>
                7.1. настоящее Согласие на обработку моих персональных данных является
                бессрочным и может быть отозвано посредством&nbsp; направления мною в адрес
                Исполнителя (Красноярский кр., г. Красноярск, ул. Академика
                Киренского&nbsp;3А,&nbsp;кв.&nbsp;68), а также по электронной почте
                hello@leafvisa.ru письменного заявления. Датой отзыва считается день,
                следующий за днем вручения Исполнителю письменного заявления об отзыве
                настоящего Согласия;
            </p>
            <p>
                7.2. имею право на доступ к моим персональным данным, требовать уточнения
                (обновление, изменение) моих персональных данных, а также удаления и
                уничтожения моих персональных данных в случае их обработки Исполнителем,
                нарушающих мои законные права и интересы, законодательство Российской
                Федерации.
            </p>
            <p>
                7.3. в случае отзыва настоящего Согласия Исполнитель вправе&nbsp; продолжить
                обработку персональных данных без моего согласия при наличии оснований,
                указанных в пунктах 2 - 11 части 1 статьи 6, части 2 статьи 10 и части 2
                статьи 11 предусмотренных Федеральным законом №152-ФЗ «О персональных
                данных» от 27.07.2006 г.&nbsp;
            </p>
            <ol start={8}>
                <li>
                    Настоящим Согласием я подтверждаю, что являюсь субъектом предоставляемых
                    персональных данных, а также подтверждаю достоверность предоставляемых
                    данных.
                </li>
                <li>
                    Настоящее Согласие действует все время до момента прекращения обработки
                    персональных данных, согласно п. 7.1 настоящего Согласия.
                </li>
                <li>
                    Настоящее Согласие подписывается пользователем при использовании ресурсов
                    интернет-сайта <a target="_blank" rel="noreferrer" href="https://leafvisa.ru/">https://leafvisa.ru/</a>
                    .
                </li>
            </ol>
            <p>&nbsp;</p>

        </ScrollPanel>
    );
};

export default ConsentToProcess;